<template>
  <div class="chat">
    <chatMessages :messages="messages"/>
    <chatInput/>
  </div>
</template>

<script>
import ChatMessages from "@/components/ChatMessages.vue";
import ChatInput from "@/components/ChatInput.vue";

export default {
  name: 'templateChat',
  components: {ChatInput, ChatMessages},
  data() {
    return {
      messages: [
        {
          author: 'AL',
          text: ["Напиши анонс конкурса на лучшее фото с собакой для официальной группы сотового оператора «Пчелка» В вконтакте. Условия - до 24 августа, 2 фото, голосование открытое среди участников группы. Призы - последний айфон и путевка на Сыктывкарские источники"]
        },
        {
          author: 'e',
          text: ["📸🐶 Участвуй в нашем конкурсе 'Лучшее фото с собакой' и выиграй отличные призы от сотового оператора 'Пчелка'! 📱🏞",
            "Дорогие подписчики! У вас есть уникальная возможность продемонстрировать свою любовь к пушистым друзьям и выиграть потрясающие призы. Примите участие в нашем конкурсе, чтобы побороться за последний iPhone и незабываемую путевку на Сыктывкарские источники.",
              "Условия участия:<br>📅 Сроки проведения: сейчас и до 24 августа.<br>📷 Загрузите не менее чем 2 фотографии с вашими верными четвероногими друзьями.",
              "Как принять участие:<br>1. Присоединитесь к официальной группе 'Пчелка' во ВКонтакте, если вы ещё не участник.<br>2. Откройте раздел 'Конкурсы' в нашей группе.<br>3. Создайте пост с фотографиями ваших собак, используя хэштег #ПчелкаСобаки.<br>4. Не забудьте оставить краткое описание, поделившись интересными историями о вашей дружбе с пушистыми спутниками.",
              "Голосование и победители:<br>👍 Голосование будет открыто среди участников группы 'Пчелка'.<br>🏆 Победитель будет определен по результатам голосования и объявлен после завершения конкурса.",
            "Призы:<br> 🥇 Первое место: Последний iPhone — передовой смартфон для настоящих технофанатов!<br> 🥈 Второе место: Незабываемая путевка на Сыктывкарские источники — отдыхайте и наслаждайтесь природой с вашими пушистыми спутниками.<br>Не упустите шанс показать свою собаку всему миру и выиграть потрясающие призы от 'Пчелка'! Участвуйте в конкурсе прямо сейчас.<br>Пусть ваша дружба с собакой станет вдохновением для всех нас! 🐾📱🌟"]
        },
        {
          author: 'AL',
          text: ["Добавь в список призов камеру ГоПро 11"]
        },
        {
          author: 'e',
          text: ["Copy test 2"]
        }
      ]
    }
  }
}
</script>

<style>
.chat {
  //padding: 20px 30px 20px 30px;
}
</style>